anthropic.claude-code
badlogicgames.serial-plotter
bradlc.vscode-tailwindcss
cschlosser.doxdocgen
eamodio.gitlens
ecmel.vscode-html-css
esbenp.prettier-vscode
espressif.esp-idf-extension
franneck94.c-cpp-runner
github.copilot-chat
humao.rest-client
komakamaki.vscode-api-client-lite
lvgl.lvgl-project-creator-vscode
mathiasfrohlich.kotlin
mechatroner.rainbow-csv
ms-dotnettools.vscode-dotnet-runtime
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.cmake-tools
ms-vscode.cpp-devtools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.remote-explorer
ms-vscode.vscode-serial-monitor
platformio.platformio-ide
rangav.vscode-thunder-client
redhat.java
ritwickdey.liveserver
tonybaloney.vscode-pets
twxs.cmake
usernamehw.errorlens
vadimcn.vscode-lldb
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
xabikos.javascriptsnippets
